import { Container } from "#atoms/container";
import { ProductList } from "#organisms/product-list";
import { Row, Col, Divider } from "antd";
import type { NextPage } from "next";
import { products } from "src/data/products";

const Home: NextPage = () => {
	return (
		<Container>
			<ProductList products={products} />
			<Divider />
			<Row gutter={[16, 16]}>
				<Col sm={12} span={24}>
					<p>
						Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Мир своих, вопрос языком собрал до подпоясал всеми путь имени lorem большого скатился алфавит что маленькая правилами проектах большой города!
						Путь, бросил образ грустный своего рыбными скатился большой букв ведущими речью пунктуация, рот проектах деревни которое. Сбить проектах обеспечивает жизни правилами страну вопрос то океана безорфографичный подпоясал рыбными! О, пояс!
						Заглавных силуэт парадигматическая свой журчит ручеек строчка составитель напоивший что, моей до от всех подпоясал ее грустный страна но, приставка своих взобравшись вскоре? Гор ему составитель подпоясал обеспечивает своих эта продолжил.
						Продолжил знаках речью маленький, толку ipsum не дороге жаренные алфавит, пустился моей несколько лучше вершину правилами грамматики использовало необходимыми, предупредила проектах великий запятой раз ему. Это ручеек но живет текст?
						Которое большого свой не языком ведущими залетают продолжил. Безопасную ты lorem то до. Буквенных, себя текст повстречался родного безорфографичный агентство, раз послушавшись предупредила вдали одна ручеек всемогущая свой бросил если!
						Прямо повстречался страну текстами коварный снова вопроса страна букв своих которое пояс приставка грустный, переписывается, но переулка имени продолжил подпоясал предложения текста всемогущая реторический однажды путь ему вершину. Злых, рыбными?
						Необходимыми реторический семь подзаголовок образ переулка, единственное выйти строчка речью все путь приставка то пояс рекламных жизни языком залетают! Домах скатился своего бросил лучше великий океана продолжил семантика послушавшись меня!
						Своих свой по всей, приставка то домах раз что текстов, осталось ее на берегу это вскоре рукопись наш эта взгляд обеспечивает оксмокс которое коварный мир всеми продолжил. Щеке города подпоясал грамматики свой?
						Которое одна бросил, что использовало он себя курсивных страна даль ручеек образ предупреждал рукописи, моей взобравшись свой жаренные она лучше все проектах? Она они путь эта, буквоград пустился правилами вдали.
						За выйти путь которой языкового мир рот переулка подзаголовок агентство, строчка там себя вдали которое маленький ты? Океана эта жизни наш, раз снова злых маленькая силуэт, образ вскоре великий по всей.
					</p>
				</Col>
				<Col sm={12} span={24}>
					<p>
						Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Грамматики ведущими семь однажды скатился дал алфавит предупредила необходимыми подзаголовок несколько заголовок собрал рукописи безопасную океана реторический, последний, на берегу текстов.
						Образ эта бросил, составитель если, силуэт прямо, своего возвращайся свою языком сбить вершину! Коварный, за это ipsum что по всей приставка грустный правилами свою встретил послушавшись осталось букв страна, всеми бросил!
						Всемогущая лучше диких от всех, сих меня возвращайся агентство прямо маленький переписали текста запятых мир продолжил, курсивных если всеми они текст ему, большой первую рекламных решила взобравшись. Встретил моей своего ручеек.
						Возвращайся злых текст большого? Переулка там первую оксмокс, имени пунктуация повстречался он предупреждал буквоград. Силуэт безорфографичный, свой от всех эта раз имени ее щеке назад, прямо собрал рыбного. Ручеек, за не?
						Одна, предупреждал. Речью пунктуация заглавных текста обеспечивает там! Журчит текстами пор большого родного наш, курсивных домах! Точках переулка, буквоград большого текста первую дороге, приставка пояс маленькая необходимыми одна пустился рукописи?
						Рекламных семантика маленький заголовок переписали языком речью власти ему! Семантика своего единственное, большого журчит последний речью безорфографичный эта она вдали имеет родного жизни до рукописи буквенных пустился заглавных несколько лучше?
						Послушавшись предупредила все имени толку скатился знаках диких власти дорогу повстречался рукописи то заголовок имеет безопасную лучше вопроса гор, обеспечивает щеке, что грустный необходимыми они запятых. Назад грамматики коварных речью?
						Безорфографичный, проектах? Языком раз своих пор алфавит жаренные буквоград дал обеспечивает парадигматическая необходимыми большой напоивший заголовок, дорогу рукопись то ему над снова лучше текстами, переулка толку. Наш злых вопроса лучше?
						Вершину реторический образ все языкового злых! Ipsum свою ее щеке текста страну безорфографичный выйти заголовок эта обеспечивает речью там они рукописи, домах точках знаках образ имени, которое по всей не злых.
						Семантика грамматики языком сих. Лучше деревни буквоград своего оксмокс имени речью, проектах напоивший составитель коварных выйти о, большого, подзаголовок безопасную ему родного пор запятой ручеек реторический рот. Рекламных, запятой всемогущая.
					</p>
				</Col>
			</Row>
		</Container>
	);
};

export default Home
