import { TBanner } from "#types/banner/TBanner";

export const banners: TBanner[] = [
	{
		id: 1,
		title: "Заголовок слайдера номер 1",
		subtitle: "Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные. Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные. Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные.",
		image: "/banners/hero-1.jpg",
		images: [
			{
				id: 1,
				path: "",
			},
		],
	},
	{
		id: 2,
		title: "Заголовок слайдера номер 2",
		subtitle: "Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные.Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные.",
		image: "/banners/hero-2.webp",
		images: [
			{
				id: 1,
				path: "",
			},
		],
	},
];